app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "recruiter_id") VALUES (?, ?, ?, ?, ?)  [["title", "dsadsa"], ["content", "sadsad"], ["created_at", "2017-09-17 04:49:21.430941"], ["updated_at", "2017-09-17 04:49:21.430941"], ["recruiter_id", 1]]
---
  def create
    @post =current_recruiter.posts.build(post_params)

    respond_to do |format|
      if @post.save